export const educationTypes = {
  0: '幼儿园',
  1: '小学',
  2: '初中',
};

export const schoolTypes = {
  0: '分享学区',
  1: '共享学区',
  2: '单享学区',
  3: '优享学区',
  4: '大学区',
};

export const schoolBelongTo = {
  0: '第一学区',
  1: '第二学区',
  2: '第三学区',
  3: '第四学区',
  4: '第五学区',
  5: '第六学区',
};

// 学校信息

export const schoolData = [{
  educationType: 1,
  schoolName: '西乡小学',
  schoolBelongTo: 1,
  schoolType: 1,
  schoolTel: '-',
  schoolClass: '-',
  longitude: '113.8766349',
  latitude: '22.57605',
  memo: '',
  belongsText: '宝安大道以东，新安五路以北，107国道以西，通达路穿过铁仔山延伸至东方建富愉盛工业园与西成工业城分界所在路以南。',
  belongs: [[113.886848, 22.574462], [113.880338, 22.56883], [113.873298, 22.573827], [113.867151, 22.578825], [113.855518, 22.587677], [113.857646, 22.589973], [113.858449, 22.58945], [113.861788, 22.593156], [113.865744, 22.596917], [113.867852, 22.598434], [113.876478, 22.585537], [113.880263, 22.580902]]
},
{

  educationType: 1,
  schoolName: '共乐小学',
  schoolBelongTo: 1,
  schoolType: 1,
  schoolTel: '-',
  schoolClass: '-',
  longitude: '113.870991',
  latitude: '22.577765',
  memo: '',
  belongsText: '宝安大道以东，新安五路以北，107国道以西，通达路穿过铁仔山延伸至东方建富愉盛工业园与西成工业城分界所在路以南。',
  belongs: [[113.886848, 22.574462], [113.880338, 22.56883], [113.873298, 22.573827], [113.867151, 22.578825], [113.855518, 22.587677], [113.857646, 22.589973], [113.858449, 22.58945], [113.861788, 22.593156], [113.865744, 22.596917], [113.867852, 22.598434], [113.876478, 22.585537], [113.880263, 22.580902]]
},
{
  educationType: 1,
  schoolName: '龙腾小学',
  schoolBelongTo: 1,
  schoolType: 1,
  schoolTel: '-',
  schoolClass: '-',
  longitude: '113.87555',
  latitude: '22.580416',
  memo: '',
  belongsText: '宝安大道以东，新安五路以北，107国道以西，通达路穿过铁仔山延伸至东方建富愉盛工业园与西成工业城分界所在路以南。',
  belongs: [[113.886848, 22.574462], [113.880338, 22.56883], [113.873298, 22.573827], [113.867151, 22.578825], [113.855518, 22.587677], [113.857646, 22.589973], [113.858449, 22.58945], [113.861788, 22.593156], [113.865744, 22.596917], [113.867852, 22.598434], [113.876478, 22.585537], [113.880263, 22.580902]]
},
{
  educationType: 1,
  schoolName: '西湾小学',
  schoolBelongTo: 1,
  schoolType: 1,
  schoolTel: '-',
  schoolClass: '-',
  longitude: '113.856643',
  latitude: '22.576293',
  memo: '(可分享【西乡小学、共乐小学、龙腾小学】共享学区学位)',
  belongsText: '铜鼓路、碧海湾高尔夫俱乐部以南，金湾大道以东，西乡大道以北，宝安大道以西。',
  belongs: [[113.86848, 22.577744], [113.852747, 22.561223], [113.845501, 22.573448], [113.851208, 22.579247], [113.851595, 22.579102], [113.852963, 22.580663], [113.854501, 22.582054], [113.856152, 22.580974], [113.856014, 22.581304], [113.855736, 22.583359], [113.855241, 22.585341], [113.855433, 22.58595], [113.856204, 22.586865]]
},
{
  educationType: 1,
  schoolName: '碧海小学',
  schoolBelongTo: 1,
  schoolType: 1,
  schoolTel: '-',
  schoolClass: '-',
  longitude: '113.852789',
  latitude: '22.567166',
  memo: '(可分享【西乡小学、共乐小学、龙腾小学】共享学区学位)',
  belongsText: '铜鼓路、碧海湾高尔夫俱乐部以南，金湾大道以东，西乡大道以北，宝安大道以西。',
  belongs: [[113.86848, 22.577744], [113.852747, 22.561223], [113.845501, 22.573448], [113.851208, 22.579247], [113.851595, 22.579102], [113.852963, 22.580663], [113.854501, 22.582054], [113.856152, 22.580974], [113.856014, 22.581304], [113.855736, 22.583359], [113.855241, 22.585341], [113.855433, 22.58595], [113.856204, 22.586865]]
},
{
  educationType: 1,
  schoolName: '海港小学',
  schoolBelongTo: 1,
  schoolType: 1,
  schoolTel: '-',
  schoolClass: '-',
  longitude: '113.854019',
  latitude: '22.571202',
  memo: '(可分享【西乡小学、共乐小学、龙腾小学】共享学区学位)',
  belongsText: '铜鼓路、碧海湾高尔夫俱乐部以南，金湾大道以东，西乡大道以北，宝安大道以西。',
  belongs: [[113.86848, 22.577744], [113.852747, 22.561223], [113.845501, 22.573448], [113.851208, 22.579247], [113.851595, 22.579102], [113.852963, 22.580663], [113.854501, 22.582054], [113.856152, 22.580974], [113.856014, 22.581304], [113.855736, 22.583359], [113.855241, 22.585341], [113.855433, 22.58595], [113.856204, 22.586865]]
},
{
  educationType: 1,
  schoolName: '宝安小学（集团）红树林外国语小学',
  schoolBelongTo: 1,
  schoolType: 1,
  schoolTel: '-',
  schoolClass: '-',
  longitude: '113.85149',
  latitude: '22.570978',
  memo: '(可分享【西乡小学、共乐小学、龙腾小学】共享学区学位)',
  belongsText: '铜鼓路、碧海湾高尔夫俱乐部以南，金湾大道以东，西乡大道以北，宝安大道以西。',
  belongs: [[113.86848, 22.577744], [113.852747, 22.561223], [113.845501, 22.573448], [113.851208, 22.579247], [113.851595, 22.579102], [113.852963, 22.580663], [113.854501, 22.582054], [113.856152, 22.580974], [113.856014, 22.581304], [113.855736, 22.583359], [113.855241, 22.585341], [113.855433, 22.58595], [113.856204, 22.586865]]
}]